
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_api_management_subscription.et_acas_subscription
* Replace
  * module.et-acas-mgmt-api.azurerm_api_management_api.api


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.et_acas_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "et_acas_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/subscriptions/d0d6a8b1-af3a-458e-86c2-29fabc413001"
        # (10 unchanged attributes hidden)
    }

  # module.et-acas-mgmt-api.azurerm_api_management_api.api must be replaced
-/+ resource "azurerm_api_management_api" "api" {
      ~ id                    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/apis/et-acas-api;rev=1" -> (known after apply)
      ~ is_current            = true -> (known after apply)
      ~ is_online             = false -> (known after apply)
        name                  = "et-acas-api"
      ~ revision              = "1" -> "2" # forces replacement
      + version               = (known after apply)
      + version_set_id        = (known after apply)
        # (12 unchanged attributes hidden)

      ~ subscription_key_parameter_names (known after apply)
      - subscription_key_parameter_names {
          - header = "Ocp-Apim-Subscription-Key" -> null
          - query  = "subscription-key" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1243,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->